src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаДействияС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаДействияПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СоимостьЧасаРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ГруппаЭлементовАбонентскогоОбслуживания = Элементы.Добавить("ГруппаЭлементовАбонентскогоОбслуживания", Тип("ГруппаФормы") );
	ГруппаЭлементовАбонентскогоОбслуживания.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаЭлементовАбонентскогоОбслуживания.ОтображатьЗаголовок = Ложь;
	ГруппаЭлементовАбонентскогоОбслуживания.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ВКМ_ДобавитьРеквизитыНаФорму();
	ВКМ_УстановитьВидимостьДобавленныхЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВКМ_УстановитьВидимостьДобавленныхЭлементов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ДобавитьРеквизитыНаФорму()
	
	ГруппаДействиеДоговора = Элементы.Добавить("ГруппаДействиеДоговора", Тип("ГруппаФормы"), Элементы.ГруппаЭлементовАбонентскогоОбслуживания);
	ГруппаДействиеДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДействиеДоговора.ОтображатьЗаголовок = Ложь;
	ГруппаДействиеДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	
	ЭлементДатаДействияС = Элементы.Добавить("ДатаДействияС", Тип("ПолеФормы"), ГруппаДействиеДоговора);
	ЭлементДатаДействияС.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементДатаДействияС.ПутьКДанным = "Объект.ВКМ_ДатаДействияС";
	
	ЭлементДатаДействияПО = Элементы.Добавить("ДатаДействияПО", Тип("ПолеФормы"), ГруппаДействиеДоговора );
	ЭлементДатаДействияПО.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементДатаДействияПО.ПутьКДанным = "Объект.ВКМ_ДатаДействияПо";
	
	ГруппаУсловийДоговора = Элементы.Добавить("ГруппаУсловийДоговора", Тип("ГруппаФормы"), Элементы.ГруппаЭлементовАбонентскогоОбслуживания);
	ГруппаУсловийДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаУсловийДоговора.ОтображатьЗаголовок = Ложь;
	ГруппаУсловийДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	
	ЭлементСуммаАбонентскойПлаты = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"), ГруппаУсловийДоговора);
	ЭлементСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	
	ЭлементСоимостьЧасаРабот = Элементы.Добавить("СоимостьЧасаРабот", Тип("ПолеФормы"), ГруппаУсловийДоговора);
	ЭлементСоимостьЧасаРабот.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСоимостьЧасаРабот.ПутьКДанным = "Объект.ВКМ_СоимостьЧасаРабот";

КонецПроцедуры

&НаСервере
Процедура ВКМ_УстановитьВидимостьДобавленныхЭлементов()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
	Элементы.ГруппаЭлементовАбонентскогоОбслуживания.Видимость = Истина;
	Иначе
	Элементы.ГруппаЭлементовАбонентскогоОбслуживания.Видимость = Ложь; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
